openFoam_coarse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	inlet     
	{
        	type           	turbulentInlet;
        	referenceField  uniform (1 0 0);
	        fluctuationScale (0.05 0.05 0);
	        alpha           0.1;
		//referenceField	(1 0 0);
         	//fluctuationScale (0.05 0.05 0.0);
        	//value           uniform (1 0 0);
    	}
      	outlet
      	{
          	type            inletOutlet;
          	inletValue      uniform (0 0 0);
          	value           uniform (0 0 0);
      	}
	cylinder
	{
		type 		noSlip;
	}

	top
	{
		type 		symmetryPlane;
	}
	bottom
	{
		type 		symmetryPlane;
	}

    	FrontAndBack
    	{
        	type            empty;
    	}
}

// ************************************************************************* //
