openFoam_coarse/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    	inlet
    	{
        	type            fixedValue;
        	value           uniform 0;
    	}

    	outlet
    	{
        	type            inletOutlet;
        	inletValue      uniform 0;
        	value           uniform 0;
    	}

    	cylinder 
    	{
        	type            zeroGradient;
    	}

    	top 
    	{
        	type            symmetryPlane;
    	}
	bottom
	{
		type 		symmetryPlane;
	}
    	FrontAndBack
    	{
        	type            empty;
    	}
}

// ************************************************************************* //
